//本文件提供关于数学部分的题目逻辑
export const ThreeMovesToPassTheLevel = {
    1: {
        one: [
            '树高约9',
            '黑板长5',
            '床长 2',
            '操场长 200',
            '一根铁钉长5',
            '粉笔盒高 8',
            '小桥宽约3',
            '旗杆高 15',
            '铅笔长 15'
        ],
        two: [
            '1米 =( )厘米',
            '600厘米=()米',
            '50米=()厘米',
            '100厘米=()米',
            '4米=()厘米',
            '300厘米=()米',
            '2米=()厘米',
            '10米=()厘米',
            '700厘米=()米',
            '400厘米=()米',
            '900厘米=()米',
            '12米=()厘米',
            '6米=()厘米',
            '500厘米=()米',
            '8米=()厘米'
        ],
        'three': [
            '3米⚪300 厘米',
            "40 厘米⚪ 4米",
            "900米⚪ 8米",
            '50 米⚪ 85 厘米',
            "1 米 ⚪50 厘米",
            "60 厘米 ⚪37 厘米",
            "10 厘米 ⚪10 米",
            '700 厘米 ⚪7米'
        ]
    },
    2: {
        'one': [
            '一根跳绳长2',
            '讲台的长大约是2',
            '一把牙刷长16',
            '小明的身高大约是130',
            '教室长8',
            '1本数学书大约厚1'
        ],
        'two': [
            "1米⚪59厘米",
            '9米⚪9厘米',
            '3米⚪30厘米',
            '70米⚪700厘米',
            '100厘米⚪1米',
            '4米⚪7米',
            '1米⚪99厘米',
            '4米⚪50厘米',
            '2米⚪20厘米',
            '40 米⚪80厘米',
            '90 厘米⚪50 厘米',
            '40 厘米⚪4米',
        ],
        "three": [
            " 13厘米-8厘米=()厘米",
            ' 8厘米-2厘米=()厘米',
            '27米+6米=()米',
            '42厘米+8厘米=()厘米',
            '22米十4米=()米',
            '32厘米-8厘米=()厘米',
            '40厘米-8厘米=()厘米',
            "64米+7米=( )米",
        ]
    },
    3: {
        'one': '../../assets/images/math/threePass/3_1.png',
        'two': '../../assets/images/math/threePass/3_2.png',
        "three": '../../assets/images/math/threePass/3_3.png'
    },
    4: {
        'one': '../../assets/images/math/threePass/4_1.png',
        'two': '../../assets/images/math/threePass/4_2.png',
        "three": '../../assets/images/math/threePass/4_3.png'
    },
    5: {
        'one': '../../assets/images/math/threePass/5_1.png',
        'two': '../../assets/images/math/threePass/5_2.png',
        "three": '../../assets/images/math/threePass/5_3.png'
    },
    6: {
        'one': '',
        'two': '',
        'three': ''
    }
}

export const num = 3